Revit 2027 API
TableCellStyleOverrideOptions(TableCellStyleOverrideOptions) Constructor
 Creates a new instance by copying an existing instance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public TableCellStyleOverrideOptions(
	TableCellStyleOverrideOptions other
)
Public Sub New (
	other As TableCellStyleOverrideOptions
)
public:
TableCellStyleOverrideOptions(
	TableCellStyleOverrideOptions^ other
)
new :
        other : TableCellStyleOverrideOptions -> TableCellStyleOverrideOptions
Parameters
other TableCellStyleOverrideOptions
 The instance to copy
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
TableCellStyleOverrideOptions Class
TableCellStyleOverrideOptions Overload
Autodesk.Revit.DB Namespace